In [20]:
import pandas as pd 


data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

Display the first 3 rows of the DataFrame to get an overview of the data. (use the head() methode for this)

In [21]:
print("data exploration")
employees = pd.DataFrame(data)
employees.head(3)

data exploration

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000

- Check the summary statistics for the 'Salary' column. (use the describe() methode for this)

In [31]:
employees["Salary"].describe()

count        5.00000
mean     70000.00000
std       7905.69415
min      60000.00000
25%      65000.00000
50%      70000.00000
75%      75000.00000
max      80000.00000
Name: Salary, dtype: float64

In [33]:
employees['Department'].value_counts()
#employees_df.groupby('Department').size()

Department
HR           1
IT           1
Finance      1
Marketing    1
Sales        1
Name: count, dtype: int64

In [34]:
print("Average salary of employees:")
employees['Salary'].mean()

Average salary of employees:

70000.0

In [39]:
max_salary = employees["Salary"].max()
employees[employees['Salary'] == max_salary]

   EmployeeID     Name Department  Salary
2         103  Charlie    Finance   80000

In [44]:
print("Department with the lowest average salary:")
min_avg_salary_dept = employees.groupby('Department')['Salary'].mean().idxmin()
min_avg_salary_dept

Department with the lowest average salary:

'HR'

In [47]:
employees['Salary Increase'] = employees['Salary'] * 1.1
employees

   EmployeeID     Name Department  Salary  Salary Increase
0         101    Alice         HR   60000          66000.0
1         102      Bob         IT   75000          82500.0
2         103  Charlie    Finance   80000          88000.0
3         104    David  Marketing   70000          77000.0
4         105     Emma      Sales   65000          71500.0